app/controllers/counters_controller.rb

  def increment_plus
    @counter.increment!(:plus)
---
UPDATE "counters" SET "plus" = COALESCE("counters"."plus", 0) + 1 WHERE "counters"."id" = 1

  def increment_minus
    @counter.increment!(:minus)
---
UPDATE "counters" SET "minus" = COALESCE("counters"."minus", 0) + 1 WHERE "counters"."id" = 1